// Created by Александр on 04.11.2019.
//Задача № 4 (5 баллов)
//Даны неотрицательные целые числа n,k и массив целых чисел из [0..10^9] размера n.
// Требуется найти k-ю порядковую статистику. т.е. напечатать число, которое бы стояло на позиции с индексом k (0..n-1) в отсортированном массиве. Напишите нерекурсивный алгоритм.
//Требования к дополнительной памяти: O(n). Требуемое среднее время работы: O(n).
//Функцию Partition следует реализовывать методом прохода двумя итераторами в одном направлении. Описание для случая прохода от начала массива к концу:
//Выбирается опорный элемент. Опорный элемент меняется с последним элементом массива.
//Во время работы Partition в начале массива содержатся элементы, не бОльшие опорного.
// Затем располагаются элементы, строго бОльшие опорного. В конце массива лежат нерассмотренные элементы. Последним элементом лежит опорный.
//Итератор (индекс) i указывает на начало группы элементов, строго бОльших опорного.
//Итератор j больше i, итератор j указывает на первый нерассмотренный элемент.
//Шаг алгоритма. Рассматривается элемент, на который указывает j. Если он больше опорного, то сдвигаем j.
//Если он не больше опорного, то меняем a[i] и a[j] местами, сдвигаем i и сдвигаем j.
//В конце работы алгоритма меняем опорный и элемент, на который указывает итератор i.
//4_3. Реализуйте стратегию выбора опорного элемента “случайный элемент”. Функцию Partition реализуйте методом прохода двумя итераторами от начала массива к концу.
#include <iostream>
int Partition(int * array, int start_point, int size) {
    // выбираем случайный элемент
    int pivot, i, j;
    pivot = rand() % (size - 1 - start_point) + start_point;
//        меняем местами последний и выбранный
    std::swap(array[pivot], array[size - 1]);
    i = j = start_point;
    for (; j < size; j++) {
        if (array[j] <= array[size - 1]) {
            std::swap(array[i], array[j]);
            i++;
        }
    }
    return i - 1;
}
int findKOrderStatistic(int * array, int size, int k) {
    int mid, start_point = 0;
    while (true) {
        mid = Partition(array, start_point, size);
        if (k == mid  || (k == size - 1 && mid  == size - 2) || (k == start_point && mid == start_point + 1)){
                return array[k];
            }
        else if (k > mid) {
            start_point = mid + 1;
        }
        else if (k < mid) {
            size = mid;
        }
    }
}
int main(){
    int n, k;
    std:: cin >> n >> k;
    int  array[n];
    for (int i = 0; i < n; i++) {
        std::cin >> array[i];
    }
    std::cout << findKOrderStatistic(array, n, k);
    return 0;
}